#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
google_sql_user.users: Refreshing state... [id=outputudy_user//outputudy-db]
google_cloud_run_v2_service_iam_binding.frontend_noauth: Refreshing state... [id=projects/outputudy/locations/asia-northeast1/services/outputudy-frontend/roles/run.invoker]
google_service_account.scheduler_sa: Refreshing state... [id=projects/outputudy/serviceAccounts/outputudy-scheduler-sa@outputudy.iam.gserviceaccount.com]
google_service_account_iam_member.workload_identity_user: Refreshing state... [id=projects/outputudy/serviceAccounts/github-actions-sa@outputudy.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principalSet://iam.googleapis.com/projects/985798282278/locations/global/workloadIdentityPools/github-actions-pool/attribute.repository/umwinter/outputudy]
google_project_iam_member.github_actions_editor: Refreshing state... [id=outputudy/roles/editor/serviceAccount:github-actions-sa@outputudy.iam.gserviceaccount.com]
google_project_iam_member.scheduler_sql_admin: Refreshing state... [id=outputudy/roles/cloudsql.admin/serviceAccount:outputudy-scheduler-sa@outputudy.iam.gserviceaccount.com]
google_cloud_run_v2_service_iam_binding.backend_noauth: Refreshing state... [id=projects/outputudy/locations/asia-northeast1/services/outputudy-backend/roles/run.invoker]
google_project_service.apis["compute.googleapis.com"]: Refreshing state... [id=outputudy/compute.googleapis.com]
google_project_service.apis["sqladmin.googleapis.com"]: Refreshing state... [id=outputudy/sqladmin.googleapis.com]
google_cloud_scheduler_job.db_stopper: Refreshing state... [id=projects/outputudy/locations/asia-northeast1/jobs/outputudy-db-stopper]
google_project_service.apis["artifactregistry.googleapis.com"]: Refreshing state... [id=outputudy/artifactregistry.googleapis.com]
google_project_service.apis["cloudresourcemanager.googleapis.com"]: Refreshing state... [id=outputudy/cloudresourcemanager.googleapis.com]
google_project_service.apis["run.googleapis.com"]: Refreshing state... [id=outputudy/run.googleapis.com]
google_project_service.apis["servicenetworking.googleapis.com"]: Refreshing state... [id=outputudy/servicenetworking.googleapis.com]
google_project_service.apis["storage.googleapis.com"]: Refreshing state... [id=outputudy/storage.googleapis.com]
google_project_service.apis["cloudscheduler.googleapis.com"]: Refreshing state... [id=outputudy/cloudscheduler.googleapis.com]
google_project_service.apis["iam.googleapis.com"]: Refreshing state... [id=outputudy/iam.googleapis.com]
google_project_service.apis["secretmanager.googleapis.com"]: Refreshing state... [id=outputudy/secretmanager.googleapis.com]
module.networking.google_compute_network.vpc: Refreshing state... [id=projects/outputudy/global/networks/outputudy-vpc]
module.iam.google_iam_workload_identity_pool.pool: Refreshing state... [id=projects/outputudy/locations/global/workloadIdentityPools/github-actions-pool]
google_artifact_registry_repository.repo: Refreshing state... [id=projects/outputudy/locations/asia-northeast1/repositories/outputudy]
google_storage_bucket.media: Refreshing state... [id=outputudy-media]
module.iam.google_service_account.github_actions: Refreshing state... [id=projects/outputudy/serviceAccounts/github-actions-sa@outputudy.iam.gserviceaccount.com]
google_storage_bucket.tfstate: Refreshing state... [id=outputudy-tfstate]
module.iam.google_iam_workload_identity_pool_provider.provider: Refreshing state... [id=projects/outputudy/locations/global/workloadIdentityPools/github-actions-pool/providers/github-provider]
module.networking.google_compute_global_address.private_ip_address: Refreshing state... [id=projects/outputudy/global/addresses/outputudy-private-ip]
module.networking.google_compute_subnetwork.subnet: Refreshing state... [id=projects/outputudy/regions/asia-northeast1/subnetworks/outputudy-subnet]
module.networking.google_service_networking_connection.private_vpc_connection: Refreshing state... [id=projects%2Foutputudy%2Fglobal%2Fnetworks%2Foutputudy-vpc:servicenetworking.googleapis.com]
module.database.google_sql_database_instance.master: Refreshing state... [id=outputudy-db]
module.database.google_sql_database.database: Refreshing state... [id=projects/outputudy/instances/outputudy-db/databases/outputudy]
module.cloudrun.google_cloud_run_v2_job.migration: Refreshing state... [id=projects/outputudy/locations/asia-northeast1/jobs/outputudy-migration]
module.cloudrun.google_cloud_run_v2_service.frontend: Refreshing state... [id=projects/outputudy/locations/asia-northeast1/services/outputudy-frontend]
module.cloudrun.google_cloud_run_v2_service.backend: Refreshing state... [id=projects/outputudy/locations/asia-northeast1/services/outputudy-backend]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # google_cloud_run_v2_service_iam_binding.backend_noauth will be destroyed
  # (because google_cloud_run_v2_service_iam_binding.backend_noauth is not in configuration)
  - resource "google_cloud_run_v2_service_iam_binding" "backend_noauth" {
      - etag     = "BwZHMjadW8s=" -> null
      - id       = "projects/outputudy/locations/asia-northeast1/services/outputudy-backend/roles/run.invoker" -> null
      - location = "asia-northeast1" -> null
      - members  = [
          - "allUsers",
        ] -> null
      - name     = "projects/outputudy/locations/asia-northeast1/services/outputudy-backend" -> null
      - project  = "outputudy" -> null
      - role     = "roles/run.invoker" -> null
    }

  # google_cloud_run_v2_service_iam_binding.frontend_noauth will be destroyed
  # (because google_cloud_run_v2_service_iam_binding.frontend_noauth is not in configuration)
  - resource "google_cloud_run_v2_service_iam_binding" "frontend_noauth" {
      - etag     = "BwZHNOhh2I4=" -> null
      - id       = "projects/outputudy/locations/asia-northeast1/services/outputudy-frontend/roles/run.invoker" -> null
      - location = "asia-northeast1" -> null
      - members  = [
          - "allUsers",
        ] -> null
      - name     = "projects/outputudy/locations/asia-northeast1/services/outputudy-frontend" -> null
      - project  = "outputudy" -> null
      - role     = "roles/run.invoker" -> null
    }

  # google_cloud_scheduler_job.db_stopper will be destroyed
  # (because google_cloud_scheduler_job.db_stopper is not in configuration)
  - resource "google_cloud_scheduler_job" "db_stopper" {
      - attempt_deadline = "180s" -> null
      - description      = "Stop Cloud SQL instance every 4 hours to save cost" -> null
      - id               = "projects/outputudy/locations/asia-northeast1/jobs/outputudy-db-stopper" -> null
      - name             = "outputudy-db-stopper" -> null
      - paused           = false -> null
      - project          = "outputudy" -> null
      - region           = "asia-northeast1" -> null
      - schedule         = "0 */4 * * *" -> null
      - state            = "ENABLED" -> null
      - time_zone        = "Asia/Tokyo" -> null

      - http_target {
          - body        = "eyJzZXR0aW5ncyI6eyJhY3RpdmF0aW9uUG9saWN5IjoiTkVWRVIifX0=" -> null
          - headers     = {} -> null
          - http_method = "PATCH" -> null
          - uri         = "https://sqladmin.googleapis.com/sql/v1beta4/projects/outputudy/instances/outputudy-db" -> null

          - oauth_token {
              - scope                 = "https://www.googleapis.com/auth/cloud-platform" -> null
              - service_account_email = "outputudy-scheduler-sa@outputudy.iam.gserviceaccount.com" -> null
            }
        }
    }

  # google_project_iam_member.github_actions_editor will be destroyed
  # (because google_project_iam_member.github_actions_editor is not in configuration)
  - resource "google_project_iam_member" "github_actions_editor" {
      - etag    = "BwZHNSAhS3E=" -> null
      - id      = "outputudy/roles/editor/serviceAccount:github-actions-sa@outputudy.iam.gserviceaccount.com" -> null
      - member  = "serviceAccount:github-actions-sa@outputudy.iam.gserviceaccount.com" -> null
      - project = "outputudy" -> null
      - role    = "roles/editor" -> null
    }

  # google_project_iam_member.scheduler_sql_admin will be destroyed
  # (because google_project_iam_member.scheduler_sql_admin is not in configuration)
  - resource "google_project_iam_member" "scheduler_sql_admin" {
      - etag    = "BwZHNSAhS3E=" -> null
      - id      = "outputudy/roles/cloudsql.admin/serviceAccount:outputudy-scheduler-sa@outputudy.iam.gserviceaccount.com" -> null
      - member  = "serviceAccount:outputudy-scheduler-sa@outputudy.iam.gserviceaccount.com" -> null
      - project = "outputudy" -> null
      - role    = "roles/cloudsql.admin" -> null
    }

  # google_service_account.scheduler_sa will be destroyed
  # (because google_service_account.scheduler_sa is not in configuration)
  - resource "google_service_account" "scheduler_sa" {
      - account_id   = "outputudy-scheduler-sa" -> null
      - disabled     = false -> null
      - display_name = "Cloud Scheduler Service Account" -> null
      - email        = "outputudy-scheduler-sa@outputudy.iam.gserviceaccount.com" -> null
      - id           = "projects/outputudy/serviceAccounts/outputudy-scheduler-sa@outputudy.iam.gserviceaccount.com" -> null
      - member       = "serviceAccount:outputudy-scheduler-sa@outputudy.iam.gserviceaccount.com" -> null
      - name         = "projects/outputudy/serviceAccounts/outputudy-scheduler-sa@outputudy.iam.gserviceaccount.com" -> null
      - project      = "outputudy" -> null
      - unique_id    = "100963878308216975818" -> null
    }

  # google_service_account_iam_member.workload_identity_user will be destroyed
  # (because google_service_account_iam_member.workload_identity_user is not in configuration)
  - resource "google_service_account_iam_member" "workload_identity_user" {
      - etag               = "BwZHNR/jRPg=" -> null
      - id                 = "projects/outputudy/serviceAccounts/github-actions-sa@outputudy.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principalSet://iam.googleapis.com/projects/985798282278/locations/global/workloadIdentityPools/github-actions-pool/attribute.repository/umwinter/outputudy" -> null
      - member             = "principalSet://iam.googleapis.com/projects/985798282278/locations/global/workloadIdentityPools/github-actions-pool/attribute.repository/umwinter/outputudy" -> null
      - role               = "roles/iam.workloadIdentityUser" -> null
      - service_account_id = "projects/outputudy/serviceAccounts/github-actions-sa@outputudy.iam.gserviceaccount.com" -> null
    }

  # google_sql_user.users will be destroyed
  # (because google_sql_user.users is not in configuration)
  - resource "google_sql_user" "users" {
      - id                      = "outputudy_user//outputudy-db" -> null
      - instance                = "outputudy-db" -> null
      - name                    = "outputudy_user" -> null
      - password                = (sensitive value) -> null
      - project                 = "outputudy" -> null
      - sql_server_user_details = [] -> null
    }

  # module.cloudrun.google_cloud_run_v2_job.migration will be updated in-place
  # (moved from google_cloud_run_v2_job.migration)
  ~ resource "google_cloud_run_v2_job" "migration" {
      - client                   = "gcloud" -> null
      - client_version           = "550.0.0" -> null
        id                       = "projects/outputudy/locations/asia-northeast1/jobs/outputudy-migration"
        name                     = "outputudy-migration"
        # (21 unchanged attributes hidden)

      ~ template {
            # (4 unchanged attributes hidden)

          ~ template {
                # (4 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "asia-northeast1-docker.pkg.dev/outputudy/outputudy/backend:127376b8e7c99d3304117c29b26b56e5052acffb" -> "us-docker.pkg.dev/cloudrun/container/hello"
                    # (2 unchanged attributes hidden)

                    # (2 unchanged blocks hidden)
                }

                # (1 unchanged block hidden)
            }
        }
    }

  # module.cloudrun.google_cloud_run_v2_service.backend will be updated in-place
  # (moved from google_cloud_run_v2_service.backend)
  ~ resource "google_cloud_run_v2_service" "backend" {
      - client                  = "gcloud" -> null
      - client_version          = "550.0.0" -> null
        id                      = "projects/outputudy/locations/asia-northeast1/services/outputudy-backend"
        name                    = "outputudy-backend"
        # (25 unchanged attributes hidden)

      ~ template {
          ~ labels                           = {
              - "commit-sha" = "127376b8e7c99d3304117c29b26b56e5052acffb" -> null
              - "managed-by" = "github-actions" -> null
            }
            # (5 unchanged attributes hidden)

          ~ containers {
              ~ image      = "asia-northeast1-docker.pkg.dev/outputudy/outputudy/backend:127376b8e7c99d3304117c29b26b56e5052acffb" -> "us-docker.pkg.dev/cloudrun/container/hello"
                # (3 unchanged attributes hidden)

                # (4 unchanged blocks hidden)
            }

            # (2 unchanged blocks hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.cloudrun.google_cloud_run_v2_service.frontend will be updated in-place
  # (moved from google_cloud_run_v2_service.frontend)
  ~ resource "google_cloud_run_v2_service" "frontend" {
      - client                  = "gcloud" -> null
      - client_version          = "550.0.0" -> null
        id                      = "projects/outputudy/locations/asia-northeast1/services/outputudy-frontend"
        name                    = "outputudy-frontend"
        # (25 unchanged attributes hidden)

      ~ template {
          ~ labels                           = {
              - "commit-sha" = "127376b8e7c99d3304117c29b26b56e5052acffb" -> null
              - "managed-by" = "github-actions" -> null
            }
            # (5 unchanged attributes hidden)

          ~ containers {
              ~ image      = "asia-northeast1-docker.pkg.dev/outputudy/outputudy/frontend:127376b8e7c99d3304117c29b26b56e5052acffb" -> "us-docker.pkg.dev/cloudrun/container/hello"
                # (3 unchanged attributes hidden)

              - env {
                  - name  = "NEXT_PUBLIC_API_URL" -> null
                  - value = "https://outputudy-backend-wojnnlmyqa-an.a.run.app" -> null
                }

                # (3 unchanged blocks hidden)
            }

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.cloudrun.google_cloud_run_v2_service_iam_binding.backend_noauth will be created
  + resource "google_cloud_run_v2_service_iam_binding" "backend_noauth" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + location = "asia-northeast1"
      + members  = [
          + "allUsers",
        ]
      + name     = "outputudy-backend"
      + project  = (known after apply)
      + role     = "roles/run.invoker"
    }

  # module.cloudrun.google_cloud_run_v2_service_iam_binding.frontend_noauth will be created
  + resource "google_cloud_run_v2_service_iam_binding" "frontend_noauth" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + location = "asia-northeast1"
      + members  = [
          + "allUsers",
        ]
      + name     = "outputudy-frontend"
      + project  = (known after apply)
      + role     = "roles/run.invoker"
    }

  # module.database.google_cloud_scheduler_job.db_stopper will be created
  + resource "google_cloud_scheduler_job" "db_stopper" {
      + description = "Stop Cloud SQL instance every 4 hours to save cost"
      + id          = (known after apply)
      + name        = "outputudy-db-stopper"
      + paused      = (known after apply)
      + project     = "outputudy"
      + region      = "asia-northeast1"
      + schedule    = "0 */4 * * *"
      + state       = (known after apply)
      + time_zone   = "Asia/Tokyo"

      + http_target {
          + body        = "eyJzZXR0aW5ncyI6eyJhY3RpdmF0aW9uUG9saWN5IjoiTkVWRVIifX0="
          + http_method = "PATCH"
          + uri         = "https://sqladmin.googleapis.com/sql/v1beta4/projects/outputudy/instances/outputudy-db"

          + oauth_token {
              + service_account_email = (known after apply)
            }
        }
    }

  # module.database.google_project_iam_member.scheduler_sql_admin will be created
  + resource "google_project_iam_member" "scheduler_sql_admin" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "outputudy"
      + role    = "roles/cloudsql.admin"
    }

  # module.database.google_service_account.scheduler_sa will be created
  + resource "google_service_account" "scheduler_sa" {
      + account_id   = "outputudy-scheduler-sa"
      + disabled     = false
      + display_name = "Cloud Scheduler Service Account"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "outputudy"
      + unique_id    = (known after apply)
    }

  # google_sql_database.database has moved to module.database.google_sql_database.database
    resource "google_sql_database" "database" {
        id              = "projects/outputudy/instances/outputudy-db/databases/outputudy"
        name            = "outputudy"
        # (6 unchanged attributes hidden)
    }

  # module.database.google_sql_database_instance.master will be updated in-place
  # (moved from google_sql_database_instance.master)
  ~ resource "google_sql_database_instance" "master" {
      ~ deletion_protection            = false -> true
        id                             = "outputudy-db"
        name                           = "outputudy-db"
        # (13 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.database.google_sql_user.users will be created
  + resource "google_sql_user" "users" {
      + host                    = (known after apply)
      + id                      = (known after apply)
      + instance                = "outputudy-db"
      + name                    = "outputudy_user"
      + password                = (sensitive value)
      + project                 = "outputudy"
      + sql_server_user_details = (known after apply)
    }

  # google_iam_workload_identity_pool.pool has moved to module.iam.google_iam_workload_identity_pool.pool
    resource "google_iam_workload_identity_pool" "pool" {
        id                        = "projects/outputudy/locations/global/workloadIdentityPools/github-actions-pool"
        name                      = "projects/985798282278/locations/global/workloadIdentityPools/github-actions-pool"
        # (6 unchanged attributes hidden)
    }

  # google_iam_workload_identity_pool_provider.provider has moved to module.iam.google_iam_workload_identity_pool_provider.provider
    resource "google_iam_workload_identity_pool_provider" "provider" {
        id                                 = "projects/outputudy/locations/global/workloadIdentityPools/github-actions-pool/providers/github-provider"
        name                               = "projects/985798282278/locations/global/workloadIdentityPools/github-actions-pool/providers/github-provider"
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.iam.google_project_iam_member.github_actions_editor will be created
  + resource "google_project_iam_member" "github_actions_editor" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:github-actions-sa@outputudy.iam.gserviceaccount.com"
      + project = "outputudy"
      + role    = "roles/editor"
    }

  # google_service_account.github_actions has moved to module.iam.google_service_account.github_actions
    resource "google_service_account" "github_actions" {
        id           = "projects/outputudy/serviceAccounts/github-actions-sa@outputudy.iam.gserviceaccount.com"
        name         = "projects/outputudy/serviceAccounts/github-actions-sa@outputudy.iam.gserviceaccount.com"
        # (7 unchanged attributes hidden)
    }

  # module.iam.google_service_account_iam_member.workload_identity_user will be created
  + resource "google_service_account_iam_member" "workload_identity_user" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = "principalSet://iam.googleapis.com/projects/985798282278/locations/global/workloadIdentityPools/github-actions-pool/attribute.repository/umwinter/outputudy"
      + role               = "roles/iam.workloadIdentityUser"
      + service_account_id = "projects/outputudy/serviceAccounts/github-actions-sa@outputudy.iam.gserviceaccount.com"
    }

  # google_compute_global_address.private_ip_address has moved to module.networking.google_compute_global_address.private_ip_address
    resource "google_compute_global_address" "private_ip_address" {
        id                 = "projects/outputudy/global/addresses/outputudy-private-ip"
        name               = "outputudy-private-ip"
        # (12 unchanged attributes hidden)
    }

  # google_compute_network.vpc has moved to module.networking.google_compute_network.vpc
    resource "google_compute_network" "vpc" {
        id                                        = "projects/outputudy/global/networks/outputudy-vpc"
        name                                      = "outputudy-vpc"
        # (9 unchanged attributes hidden)
    }

  # google_compute_subnetwork.subnet has moved to module.networking.google_compute_subnetwork.subnet
    resource "google_compute_subnetwork" "subnet" {
        id                         = "projects/outputudy/regions/asia-northeast1/subnetworks/outputudy-subnet"
        name                       = "outputudy-subnet"
        # (12 unchanged attributes hidden)
    }

  # google_service_networking_connection.private_vpc_connection has moved to module.networking.google_service_networking_connection.private_vpc_connection
    resource "google_service_networking_connection" "private_vpc_connection" {
        id                      = "projects%2Foutputudy%2Fglobal%2Fnetworks%2Foutputudy-vpc:servicenetworking.googleapis.com"
        # (4 unchanged attributes hidden)
    }

Plan: 8 to add, 4 to change, 8 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @umwinter, Action: `pull_request`*